# 配饰
code_list1 = ['针织披肩', '水桶帽', '单鞋', '文胸', '防晒帽', '饰品', '渔夫帽', '丝巾', '遮阳帽', '帆布鞋', '长筒靴',
              '皮带', '鞋子', '袜子', '帽子', '围巾', '围脖', '包包', '配饰', '美肤衣', '手套', '毛领', '袖子毛',
              '打底袜', '毛毛围脖', '项链', '腰带', '内裤', '美背', '内衣', '头箍', '耳钉', '手镯', '手链', '发箍',
              '安全裤', '戒指', '手表', '包', '搭配', '眼镜', '耳环', '披肩', '吊带', '双色桶帽']
# 上衣
code_list2 = ['羊绒毛衣', '羊毛马甲', '条纹T恤', '灯芯绒半裙', '小花马甲', '短袖毛衣', '香香风外套', '针织打底衫',
              '球球马甲', '毛衣外套', '毛呢西装外套', '麻花马甲', '针织短袖', '针织马甲', '针织毛衣', '防晒衣',
              '牛仔上衣', '牛仔衬衣', '小衫', '小外套', '小吊带', '短外套', '短袖', '针织吊带', '小背心', '蕾丝马甲',
              '印花T', '无袖上衣', '防晒衫', '网纱绣花裙', '光板T', '吊带衫', '短袖套衫', '吊带背心', '牛仔马甲',
              '针织上衣', '针织背心', '高领马甲', '小香风', '毛衣', '打底衫', '牛仔外套', '毛呢外套', '衬衫',
              '羽绒马甲', '外套', '牛仔衬衫', '西装外套', '毛衣马甲', '毛衣开衫', '马甲', 'T恤', '西装', '卫衣',
              '皮衣外套', '衬衣', '双面呢外套', '上衣', '针织开衫', '针织衫', '小香外套', '开衫', '背心', '毛衫',
              '棉服', '帽衫', '羽绒服', '加绒卫衣', '棉衣', '呢外套', '夹棉衬衫', '棉外套', '加棉外套', '毛呢马甲',
              '羽绒背心', '加棉马甲', '羽绒外套', '小香风外套', '马夹', '上衣外套', '西装马甲', '毛呢', '羔毛字母帽衫',
              '套头衫', '高领毛衣', '坑条开衫']
# 下衣
code_list3 = ['皮衣', '灯芯绒裤子', '西裤', '铅笔裤', '抽绳牛仔裤', '皮裙', '悬浮裤', '牛仔裙', '双面呢半裙', '麻短裤',
              '背带短裤', '萝卜裤', '速干裤', '灯笼裤', '休闲裤', '牛仔半裙', '牛仔短裤', '半身裙', '阔腿裤', '长裤',
              '麻裤', '短裙', '长半裙', '裤子', '牛仔裤', '半裙', '卫裤', '裙子', '背带裤', '毛呢半裙', '呢半裙',
              '针织裤', '芭比裤', '打底裤', '毛呢裙', '短裤', '鲨鱼裤', '直筒裤', '伞裙']
# 一身
code_list4 = ['套裙', '针织披肩连衣裙', '双面呢套装', '毛衣套装', '牛仔连衣裙', '针织连衣裙', '牛仔背心裙', '连体短裤',
              '套装裙', '背心连衣裙', '吊带连衣裙', '小香风连衣裙', '套装短裙', '吊带裤', '两件套', '牛仔套装',
              '牛仔连体裤', '吊带裙', '针织背心裙', '马甲裙', '针织裙', '连体衣', '风衣', '双面呢大衣', '连衣裙',
              '牛仔背带裤', '套装', '呢大衣', '背心裙', '背带裙', '毛衣裙', '睡衣', '卫衣套装', '双面呢', '鱼尾裙',
              '大衣', '牛仔背带裙', '连体裤', '风衣外套', '羊驼毛双面呢大衣']
# 日用品
code_list5 = ['电动牙刷', '刘海夹', '洗衣液', '防晒霜', '隔离', '浴巾', '蚊子膏', '雨伞', '发膜', '杯子', '气垫',
              '修剪器', '粘毛器', '筷子', '夹发棒', '耳线', '水杯']
